In [1]:
import pandas as pd

In [3]:
df=pd.read_csv(r'D:\Desktop\Semester 6\Pattern\lab\04_02_2025\Experiment_3\Dataset\nyc_taxi.csv')

In [4]:
df.head()

             timestamp  value
0  2014-07-01 00:00:00  10844
1  2014-07-01 00:30:00   8127
2  2014-07-01 01:00:00   6210
3  2014-07-01 01:30:00   4656
4  2014-07-01 02:00:00   3820

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10320 entries, 0 to 10319
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   timestamp  10320 non-null  object
 1   value      10320 non-null  int64
dtypes: int64(1), object(1)
memory usage: 161.4+ KB

In [6]:
df['MA60'] = df['value'].rolling(60).mean()
df['MA365'] = df['value'].rolling(365).mean()
df.tail()

                 timestamp  value          MA60         MA365
10315  2015-01-31 21:30:00  24670  19638.816667  13308.419178
10316  2015-01-31 22:00:00  25721  19807.800000  13361.350685
10317  2015-01-31 22:30:00  27309  20017.633333  13415.520548
10318  2015-01-31 23:00:00  26591  20168.000000  13460.742466
10319  2015-01-31 23:30:00  26288  20255.916667  13501.473973

In [7]:
df.drop(['MA60', 'MA365'], axis=1, inplace=True)
df.head()

             timestamp  value
0  2014-07-01 00:00:00  10844
1  2014-07-01 00:30:00   8127
2  2014-07-01 01:00:00   6210
3  2014-07-01 01:30:00   4656
4  2014-07-01 02:00:00   3820

In [8]:
df.set_index('timestamp', drop=True, inplace=True)
df.head()

                     value
timestamp
2014-07-01 00:00:00  10844
2014-07-01 00:30:00   8127
2014-07-01 01:00:00   6210
2014-07-01 01:30:00   4656
2014-07-01 02:00:00   3820